
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НазваниеТОвара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");
	
	Если ПроверитьСуществованиеТОвара(НазваниеТОвара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 найден", НазваниеТОвара);
	Иначе
		ТекстСообщения = СтрШаблон("Товар %1 не найден", НазваниеТОвара);
	КонецЕсли;
	Сообщить (ТекстСообщения);
КонецПроцедуры

&НаСервере
Функция ПроверитьСуществованиеТОвара(НазваниеТОвара)
	ТоварСуществует = Справочники.Товары.НайтиТоварПоНаименованию(НазваниеТОвара);
	Возврат ТоварСуществует;
КонецФункции

